{
    "site": [
        {
            "title": "Findability",
            "details": [
                {"area":"Positives", "note":"Links are named appropriately and have large, animated, clickable areas. Contrast and word-choices help things stand out quickly. Some target audiences have distinct sections that will draw them in. Keyword searches from Google direct to the appropriate page(s). Relatively flat page hierarchy reduces clicks to get to content. Global navigation provides consistent link locations."},
                {"area":"Improvements", "note":"Some target audiences are not called out as prominently. Lack of site search will result in people giving up if they don't find content they are looking for within the first few clicks. Active page/link is not highlighted, which may cause repeat navigation. Ambiguous terms for the uninformed may cause confusion (e.g. - Advocate/Volunteer, Calendar/Events)."}
            ],
            "sort": 0
        },
        {
            "title": "Visual consistency",
            "details": [
                {"area":"Positives", "note":"Global header, navigation, and footer. Colors are used fairly well across the site."},
                {"area":"Improvements", "note":"Text line-spacing is inconsistent between pages. Form layouts differ dramatically between pages. Font colors and family differences create visual noise. Page image alignment or spacing varies on some pages. Left navigation font-size varies on services page. Link colors are inconsistent across pages."}
            ],
            "sort": 0
        },
        {
            "title": "Navigation",
            "details": [
                {"area":"Positives", "note":"Word choices are relatively clear. Large, clickable areas. "},
                {"area":"Improvements", "note":"Show active navigation item. Reduce ambiguity of some areas. Set priority for accommodating target audience needs. Quick Links are usually reserved for the landing page and reduced to a handful of items."}
            ],
            "sort": 0
        },
        {
            "title": "Content",
            "details": [
                {"area":"Positives", "note":"Abundance of content across the site. Appears to cover all target audiences with pertinent information. Appropriate external links to related sites and content."},
                {"area":"Improvements", "note":"Prioritize for each audience the content they most value. Reduce the number of clicks for someone to get to the content they want."}
            ],
            "sort": 0
        },
        {
            "title": "Priority",
            "details": [
                {"area":"Positives", "note":"Some target audiences and content have been given appropriate priority."},
                {"area":"Improvements", "note":"Reduce priority of content that does not add to the fulfillment of your vision, mission, and strategy. Reduce usable space taken up by lower priority items. "}
            ],
            "sort": 0
        },
        {
            "title": "Multi-language Support",
            "details": [
                {"area":"Positives", "note":"Providing some way to translate the page is always a good thing."},
                {"area":"Improvements", "note":"Using Google Translate interrupts and changes the user experience."}
            ],
            "sort": 0
        }
    ],
    "pages": [
        {
            "title": "Home",
            "img":"images/screenshots/01home.png",
            "link":"http://www.dcpfc.org/",
            "details": [
                {"area":"Content", "note":"The Vision and Mission statements may not be appropriate as the sole content for the site's landing page. They could be featured less prominently to increase space for more audience-specific content. The addition of content directing people to the content they might be searching for will go a long way. Additionally, the home page is a great place to put recent news, upcoming events and other notifications for a quick glance overview of what is happening."},
                {"area":"Structure", "note":"Adjust the layout according to changes for design and user experience. "},
                {"area":"Design", "note":"The large image of children at the top of the content is pleasant, but creates a large gap between the top and the rest of the content. Consider utilizing the image as a background for a header or other content for the page to better utilize the space."},
                {"area":"Usability", "note":"The rotating banner of links can prevent people from clicking because they may never stay on the page long enough to see links further in the cycle. Consider pulling the links out and placing them in a link area on the page."},
                {"area":"Priority", "note":"The predominant items on the page are images, which reduces the importance of the links and the little content on the page. Consider bringing target audiences into the site with something that is important to them from the content rather than imagery. Increase the amount of information presented, but differentiate items for different audiences."}
            ],
            "sort": 0
        },
        {
            "title": "About",
            "img":"images/screenshots/02about.png",
            "link":"http://www.dcpfc.org/about",
            "details": [
                {"area":"Content", "note":"Rich content here about the organization. Spacing out some paragraphs would help with readability. Consider having two sections with these topics: what we do, what we've done. Write about the present state of the organization and then go into a history."},
                {"area":"Structure", "note":"Adding some paragraph breaks between ideas will help improve readability."},
                {"area":"Design", "note":"An image or blockquote to create visual interest. Consider having multiple headings to differentiate factual information about the organization versus historical information abotu what the organization has done. Use text sub headers and whitespace to call out different thoughts."},
                {"area":"Usability", "note":"The text is a good size, but a little tight. Increase line spacing slightly and font-size to improve readability. Links to specific news articles announcing historical accomplishments or calendar events would also create interest to dig deeper into the site."},
                {"area":"Priority", "note":"Give priority to the factual information about the organization and then reflect on past accomplishments and history. Consider what the target audiences will want to get from this page and put that content first."}
            ],
            "sort": 1
        },
        {
            "title": "Calendar",
            "img":"images/screenshots/03calendar.png",
            "link":"http://www.dcpfc.org/dcpfc_calendar",
            "details": [
                {"area":"Content", "note":"The Google calendar is an effective tool to communicate scheduled events. Consider using the agenda view in a smaller space to list upcoming events for the week. Utilizing more of a list view may also help people browse the calendar more effectively."},
                {"area":"Structure", "note":"Changes to the layout may improve spacing. Not much control can be had without doing customization of the Google calendar."},
                {"area":"Design", "note":"Colors can be used to set the calendar more inline with the rest of the site. Utilizing a different style (like agenda) will allow for less space to be filled. Alternatively, the Google calendar API could be used to bring in events and link to the details. This could be consolidated into the events for streamlining where people go to find events. Also, utilizing different calendars and colors for different audiences may also be beneficial."},
                {"area":"Usability", "note":"Embedding the monthly Google calendar may not be the best method for presenting events since it reduces the ability to see details at a glance. There could be some improvements, but overall this is an okay way to present the calendar. Adding a legend for additional colors to separate the audiences would be helpful too."},
                {"area":"Priority", "note":"There is no priority given to calendar entries at the moment. Think about which types of events could be bubbled to the top for particular target audiences. Coloration and a legend will help draw important things to the top."}
            ],
            "sort": 2
        },
        {
            "title": "Services",
            "img":"images/screenshots/04services1.png",
            "link":"http://www.dcpfc.org/services",
            "details": [
                {"area":"Content", "note":"The repeated use of the word 'activity' doesn't seem to be understandable. Make sure to give context to people reading in words that they commonly use. The links at the top are good, but without context they may be foreign to the reader."},
                {"area":"Structure", "note":"Horizontal padding for the content could be increased to produce space between areas. Consider using an expand/collapse method for each of the services to use the space more efficiently."},
                {"area":"Design", "note":"Visual interest to continue down the page could be encouraged by adding some images or block quotes. Accordion-style expand/collapse for each item on the page would allow the space to be dynamic based on user preferences."},
                {"area":"Usability", "note":"The links at the top help navigate the page, and the links back to the top of the page help with the overall navigation. By adding the ability to hide and show content it promotes the user to click and interact with the page."},
                {"area":"Priority", "note":"All of the services are important, so it would be beneficial to present as much of the content where the user does not need to scroll or to engage them to scroll by using visual or interactive cues. Depending on the value to different target audiences the weight of the content could be adjusted."}
            ],
            "sort": 3
        },
        {
            "title": "Parents",
            "img":"images/screenshots/05parents.png",
            "link":"http://www.dcpfc.org/parents-children",
            "details": [
                {"area":"Content", "note":"The content appears to be valuable information, but doesn't necessarily correspond to the 'Parents/Children' name of the link. The lending library and choosing quality child care could be their own pages linked from this page. The printable activities are not as obvious on the page since they are in a somewhat unique location."},
                {"area":"Structure", "note":"Consider splitting the page content into two or three columns."},
                {"area":"Design", "note":"Split large content blocks with a thin line to create a visual break. If a multi-column layout can contain the information use that to bring additional content up the page. Add an image or block quote to add some additional visual interest."},
                {"area":"Usability", "note":"The page requires scrolling to view some of the content of the page. If the content could be linked and only short headlines presented that would help take back some of the space. Bring the printable activites up on the page since the space under the office image is not as obvious."},
                {"area":"Priority", "note":"Give equal priority to the content of this page. The information is valuable, but the target audience may not see the content lower on the page."}
            ],
            "sort": 4
        },
        {
            "title": "News",
            "img":"images/screenshots/06news.png",
            "link":"http://www.dcpfc.org/news",
            "details": [
                {"area":"Content", "note":"Long blocks of text that appear to be copied from other sources. Headers appear to not be relevant to the content. Consider integrating updates from social media into this page. Newsletters could be produced as web content, but you would likely lose the ability to format it in the same way. Consider using this area to call out calendar events as they approach too."},
                {"area":"Structure", "note":"Normalizing the layout of each article will help. Don't allow copy-paste to ruin a standard layout."},
                {"area":"Design", "note":"Small font sizes and line spacing make things difficult to read. Headers should be standardized to avoid inconsistent visual priority."},
                {"area":"Usability", "note":"This page should not contain full-text of articles as much as it should be a starting point for additional content. Give a title, byline, and date. Link to full-text articles can be internal or external. "},
                {"area":"Priority", "note":"Monthly newsletters or periodical content from the organization should be prioritized over other content."}
            ],
            "sort": 5
        },
        {
            "title": "Advocates",
            "img":"images/screenshots/07advocates.png",
            "link":"http://www.dcpfc.org/advocate",
            "details": [
                {"area":"Content", "note":"Long text blocks should be broken up. More technical writing styles would bring out the information more. Try using bulleted points, or quotes to call out important information."},
                {"area":"Structure", "note":"Long block of text can be improved by restricting line length or indentation."},
                {"area":"Design", "note":"Line spacing and indentation are needed. Visually cluttered without visual anchors to keep interest. Call out specific details in a block quote or graphic to summarize the information."},
                {"area":"Usability", "note":"Without knowing whether an advocate is a specifically titled role or just generally someone who advocates for the organization it is hard to begin reading. Try to pull the target audience in with a hook of some kind either graphically or textually. Could this be combined with a volunteer?"},
                {"area":"Priority", "note":"Not entirely sure of the priority of this. Seems to be very closely tied with volunteering even if not directly with the organization."}
            ],
            "sort": 6
        },
        {
            "title": "Staff",
            "img":"images/screenshots/08staff.png",
            "link":"http://www.dcpfc.org/staff",
            "details": [
                {"area":"Content", "note":"Great list of the people involved."},
                {"area":"Structure", "note":"Excellent two-column layout makes the page flow nicely. Could also add additional biographical information to humanize the staff and/or board. Also gives a venue for people to promote the reason they are involved. Consider adding phone tags to allow mobile calls when browsing from a mobile device or a browser that supports calling."},
                {"area":"Design", "note":"Two-column layout helps the page flow nicely. Make sure images are not being skewed (Karen's image proportions are off, which stretches her photo in an unflattering way). If hierarchy of board is intended, do so across the columns not down one."},
                {"area":"Usability", "note":"Easy to understand page. Add phone links for call-enabled browsers."},
                {"area":"Priority", "note":"This is likely not a high-priority page, and could be sent to the footer, or a less prominent link than the global navigation."}
            ],
            "sort": 7
        },
        {
            "title": "Contact",
            "img":"images/screenshots/09contact.png",
            "link":"http://www.dcpfc.org/contact",
            "details": [
                {"area":"Content", "note":"Simple form text with contact details. May want to differentiate office location from phone and email to provide prioritized communication modes."},
                {"area":"Structure", "note":"Page is sectioned out well. Receiving errors on map area, but may be due to infrastructure mangling code."},
                {"area":"Design", "note":"Contrast of form color may be a bit jarring. Lower the contrast, but use the same color family or use simple border around the area. Address and phone numbers are inconsistent sizes. If visual priority is trying to be achieved use sections calling out 'Office location' and 'Phone/Fax/Email'. Pair the map more closely with the office location text."},
                {"area":"Usability", "note":"Form appears to not have validation. Confirmation page though, which is good. Could add some more content to the confirmation page to direct people to specific content afterwards."},
                {"area":"Priority", "note":"Seems like a high-priority item that might be better suited to top-level navigation or a global header link."}
            ],
            "sort": 8
        },
        {
            "title": "Donate",
            "img":"images/screenshots/10donate.png",
            "link":"http://www.dcpfc.org/donate",
            "details": [
                {"area":"Content", "note":"Straight-forward form, but could use more detail about what gifts are used for, and what specific dollar figures provide to the organization. Not initially clear from the link that this would be a pledge to donate and not an actual donation form. <a href='http://bradfrostweb.com/blog/post/designing-an-effective-donate-form/'>Designing an effective donate form</a>"},
                {"area":"Structure", "note":"Form alignment could be improved to reduce inconsistent field and label positioning."},
                {"area":"Design", "note":"Inconsistent top graphic positioning. Form fields and labels should be lined up to improve form flow. Different font weights or sizes would help differentiate important text over informational text."},
                {"area":"Usability", "note":"Form lacks accessible labels and fields making it difficult to navigate quickly. Doesn't appear to have required fields called out."},
                {"area":"Priority", "note":"This is a high-priority page, bump it up to top-level global navigation or even a separate button called out in the header."}
            ],
            "sort": 9
        },
        {
            "title": "Volunteer",
            "img":"images/screenshots/11volunteer.png",
            "link":"http://www.dcpfc.org/volunteer",
            "details": [
                {"area":"Content", "note":"There are a lot of questions that require a bit of reading to understand. Simplify or consolidate wherever possible. Think about splitting out content specific to certain types of volunteers based on initial questions."},
                {"area":"Structure", "note":"Layout leaves a lot of extra whitespace and is causing the form to look misaligned. Consider using wells or fieldset to callout sections of the form."},
                {"area":"Design", "note":"Some fields should flow horizontally to eliminate excess whitespace. Headings and sections should be aligned consistently, and called out using visual cues like borders or dividers."},
                {"area":"Usability", "note":"Form is not using appropriate label or click interface to ease entry. Alignment makes understanding form values difficult. Does not appear to have validation or a success page. Unable to submit form."},
                {"area":"Priority", "note":"This seems like a high-priority piece of content worthy of the top navigation and a spot for content on the home page."}
            ],
            "sort": 10
        },
        {
            "title": "Events",
            "img":"images/screenshots/12events.png",
            "link":"http://www.dcpfc.org/events",
            "details": [
                 {"area":"Content", "note":"Consistent format for each entry will make readability much better. Try to convey as much detail in a glance as possible, so increase visibility of the date/time, location, and details in that order."},
                {"area":"Structure", "note":"Add consistent layout template for any event to fit into."},
                {"area":"Design", "note":"Inconsistent colors, fonts, alignment, and spacing. Provide a specific format, and stick with it for all events listed. Add a touch of interest with graphical elements if available."},
                {"area":"Usability", "note":"Since some event headings are larger or different color they are more noticeable. Reduce line size to bring more focus to the events. Add month sections to separate current and upcoming events."},
                {"area":"Priority", "note":"If the goal is to promote these events they should have an increased priority and maybe have a dedicated section on the home page. If there is not a commitment to the events the information may be better communicated via email or social media on a periodic basis."}
            ],
            "sort": 11
        },
        {
            "title": "Links",
            "img":"images/screenshots/13links.png",
            "link":"http://www.dcpfc.org/links",
            "details": [
                {"area":"Content", "note":"Lots of valuable links. Rename to Links from Quick Links in navigation since there are so many. "},
                {"area":"Structure", "note":"Could probably benefit from a multi-column layout or wells."},
                {"area":"Design", "note":"Link color is inconsistent with other pages. Vertical space between links could be increased. Add wells to delineate different topics. Add graphic or color to further call out differences."},
                {"area":"Usability", "note":"The abundance of links makes it difficult to immediately find the one you want. Presenting them alphabetically is a start, but further classifying the longer lists will improve overall findability."},
                {"area":"Priority", "note":"Unless these are resources essential to target audiences the global navigation could be lowered to the footer and a page to the links placed on the home page."}
            ],
            "sort": 12
        },
        {
            "title": "Research",
            "img":"images/screenshots/14research.png",
            "link":"http://www.dcpfc.org/research",
            "details": [
                {"area":"Content", "note":"Information is valuable for a specific audience."},
                {"area":"Structure", "note":"Consistent style should be defined for presenting large blocks of text."},
                {"area":"Design", "note":"Technical writing style would include more use of space and indentation. An additional image to the right in the middle of the content would provide an additional visual anchor for the text. Maybe a blockquote to call out an important quote."},
                {"area":"Usability", "note":"Large blocks of text can turn people away without something to draw them to read on."},
                {"area":"Priority", "note":"This information seems to be valuable for a specific audience, but probably not worthy of a navigation link for everyone. Consider having it be a content link somewhere a target audience would be able to click on."}
            ],
            "sort": 13
        },
        {
            "title": "Spanish Home",
            "img":"images/screenshots/15es.png",
            "link":"http://www.google.com/translate?hl=en&u=http%3A%2F%2Fwww.dcpfc.org%2F&ie=UTF8&langpair=en%7Ces",
            "details": [
                {"area":"Content", "note":"Some content is not translated because it is captured in images. "},
                {"area":"Structure", "note":"Page layout remains the same."},
                {"area":"Design", "note":"Navigation alignment is thrown off. Graphical elements with text are not translated."},
                {"area":"Usability", "note":"The navigation getting thrown off reduces the usability, but does not prevent navigation."},
                {"area":"Priority", "note":"Spanish-speaking visitors may have different priorities than English-speaking visitors."}
            ],
            "sort": 14
        }
    ],
    "tiers": [
        {
            "title": "Hosting/Services",
            "details": {
                "low": "Continue with the way things are, and utilize BlueTone at roughtly the same level that is currently done.",
                "med": "Utilize the BlueTone resources more fully to help with some of the changes and recommendations. Start to make strategic decisions based on traffic analytics.",
                "high": "Investigate alternatives or additional partners with specific areas of expertise to help with the design, usability, or development of the site. Utilize analytics to make strategic changes to the site flow or layout."
            },
            "sort": 0
        },
        {
            "title": "Design",
            "details": {
                "low": "Make minor changes based on the recommendations to bring more consistency and reduce visual clutter.",
                "med": "Add/Remove/Update images where appropriate. Reclaim space taken by large images. Adjust visual style and create a minor style guide to set standards. Focus on making priority and strategic decisions for the design.",
                "high": "Site redesign. Create an exhaustive style guide to communicate the visual details of the brand and specific content. Bring specific choices in fonts, white space, and image quality and sizes to the table. Enhance the visual layout of the site to provide target audiences with quick access to the information they are looking for."
            },
            "sort": 0
        },
        {
            "title": "Content",
            "details": {
                "low": "Reduce large blocks of text. Improve priority of content to focus on achieving strategic purposes for each target audience.",
                "med": "Bring content under style guide to define structure of common items like calendar entries, news stories, and other frequent updates. Pull large text items into separate pages or expandable areas to 'Read More'.",
                "high": "Continue with medium recommendations, and enhance the ability of other contributors to provide more frequent updates. Focus on the strategic purpose of the content, and prioritize accordingly."
            },
            "sort": 0
        },
        {
            "title": "User Experience",
            "details": {
                "low": "Fix form submissions and various link and content priorities to attract more site usage for target audiences. Work on summary information for large text blocks.",
                "med": "Reduce or allow expansion of large text blocks. Define target audiences and their most important content. Adjust home page display to allow target audiences to quickly access their desired content.",
                "high": "Bring the user experience into the style guide to provide specific standards for how new content should be presented. Make the priority of specific changes to enhance target audience flow and success in tasks as well as to encourage repeat use and exploration of the site."
            },
            "sort": 0
        },
        {
            "title": "Development",
            "details": {
                "low": "Optimize images, scripts, and styles to improve page load times. Work on improving the mobile experience through styling.",
                "med": "Consider implementing some responsive techniques into the current code. This might include looking at places where content could flow differently using media queries or scripting some different behaviors based on the size of the window. Verify success or need of mobile first development using analytics and demographic data.",
                "high": "Re-engineer the site to be completely responsive to the size of the window. This encompasses restructuring the HTML, adding styles to accommodate for different screens sizes to display the same information, and using tools to minimize or compress the assets."
            },
            "sort": 0
        }
        
    ]
}